app/views/polls/_voting_form.html.erb

<p>Options2</p>
<%=@poll.vote_options.size%>
---
SELECT "vote_options".* FROM "vote_options" WHERE "vote_options"."poll_id" = ?  [["poll_id", 2]]
SELECT COUNT(*) FROM "vote_options" WHERE "vote_options"."poll_id" = ?  [["poll_id", 2]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."vote_option_id" = ?  [["vote_option_id", 5]]