app/controllers/polls_controller.rb

SELECT "polls".* FROM "polls"
---
  def index
    @polls = Poll.all

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "vote_options".* FROM "vote_options" WHERE "vote_options"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
  @poll = Poll.includes(:vote_options).find_by_id(params[:id])

INSERT INTO "polls" ("topic") VALUES (?)  [["topic", "Hello"]]
---
  def create
    @poll = Poll.new(poll_params)
    if @poll.save

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @poll = Poll.find_by_id(params[:id])

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "polls" SET "topic" = ? WHERE "polls"."id" = ?  [["topic", "B"], ["id", 5]]
---
  def update
    @poll = Poll.find_by_id(params[:id])
    if @poll.update_attributes(poll_params)

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 2]]
---
  def destroy
    @poll = Poll.find_by_id(params[:id])
    if @poll.destroy