app/controllers/votes_controller.rb

  def create
    if current_user && params[:poll] && params[:poll][:id] && params[:vote_option] && params[:vote_option][:id]
      @poll = Poll.find_by_id(params[:poll][:id])
      @option = @poll.vote_options.find_by_id(params[:vote_option][:id])
      if @option && @poll && !current_user.voted_for?(@poll)
        @option.votes.create({user_id: current_user.id})
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "vote_options".* FROM "vote_options" WHERE "vote_options"."poll_id" = ? AND "vote_options"."id" = ? LIMIT ?  [["poll_id", 4], ["id", 2], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "vote_option_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["vote_option_id", 2], ["created_at", "2018-01-11 09:59:18.643257"], ["updated_at", "2018-01-11 09:59:18.643257"]]